dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cy_hal_qspi.c
/***************************************************************************//**
* \file cy_hal_qspi.c
*
* Description:
* Provides a high level interface for interacting with the Cypress QSPI (SMIF). 
* This is a wrapper around the lower level PDL API.
* 
********************************************************************************
* \copyright
* Copyright 2018-2019 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_hal_qspi.h"
#include "cy_smif.h"
#include "cy_hal_hwmgr.h"
#include "cy_hal_interconnect.h"

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/*******************************************************************************
*       Internal
*******************************************************************************/
/* in microseconds, timeout for all blocking functions */
#define TIMEOUT_10_MS (10000UL)

#define SMIF_MAX_RX_COUNT (65536UL)
#define QSPI_DESELECT_DELAY (7UL)

/* Default QSPI configuration */
static const cy_stc_smif_config_t default_qspi_config =
{
    .mode = (uint32_t)CY_SMIF_NORMAL,
    .deselectDelay = QSPI_DESELECT_DELAY,
    .rxClockSel = (uint32_t)CY_SMIF_SEL_INTERNAL_CLK,
    .blockEvent = (uint32_t)CY_SMIF_BUS_ERROR,
};

/* List of available QSPI instances */
SMIF_Type * smif_base_addresses[CY_IP_MXSMIF_INSTANCES] =
{
#ifdef SMIF0
    SMIF0,
#endif /* ifdef SMIF0 */
};

/* List of available QSPI interrupt sources */
IRQn_Type CY_QSPI_IRQ_N[CY_IP_MXSMIF_INSTANCES] =
{
#ifdef SMIF0
    smif_interrupt_IRQn,
#endif /* ifdef SMIF0 */
};

static void cy_qspi_0_irq_handler(void) __attribute__((unused));

/* Callback information struct */
static struct
{
    cy_qspi_t *obj;
    cy_qspi_irq_handler_t handler;
    void *irq_arg;
} irq_data_stc[CY_IP_MXSMIF_INSTANCES];

/* Translate PDL QSPI interrupt cause into QSPI HAL interrupt cause */
static cy_qspi_irq_event_t cy_convert_interrupt_from_pdl(uint32_t pdl_intr_cause)
{
    cy_qspi_irq_event_t intr_cause = CY_QSPI_IRQ_NONE;

    intr_cause |= pdl_intr_cause & CY_SMIF_ALIGNMENT_ERROR ? CY_QSPI_IRQ_ALIGNMENT_ERROR : 0;
    intr_cause |= pdl_intr_cause & CY_SMIF_RX_DATA_FIFO_UNDERFLOW ? CY_QSPI_IRQ_RX_DATA_FIFO_UNRFLW : 0;
    intr_cause |= pdl_intr_cause & CY_SMIF_TX_DATA_FIFO_OVERFLOW ? CY_QSPI_IRQ_TX_DATA_FIFO_OVRFLW : 0;
    intr_cause |= pdl_intr_cause & CY_SMIF_TX_COMMAND_FIFO_OVERFLOW ? CY_QSPI_IRQ_TX_CMD_FIFO_OVRFLW : 0;
    intr_cause |= pdl_intr_cause & CY_SMIF_TX_DATA_FIFO_LEVEL_TRIGGER ? CY_QSPI_IRQ_TX_DATA_FIFO_LEVEL_TRG : 0;
    intr_cause |= pdl_intr_cause & CY_SMIF_RX_DATA_FIFO_LEVEL_TRIGGER ? CY_QSPI_IRQ_RX_DATA_FIFO_LEVEL_TRG : 0;

    return intr_cause;
}

/* Translate QSPI HAL interrupt cause into QSPI PDL interrupt cause */
static uint32_t cy_convert_interrupt_to_pdl(uint32_t event_cause)
{
    uint32_t pdl_intr_cause = 0u;

    pdl_intr_cause |= event_cause & CY_QSPI_IRQ_ALIGNMENT_ERROR ? CY_SMIF_ALIGNMENT_ERROR : 0;
    pdl_intr_cause |= event_cause & CY_QSPI_IRQ_RX_DATA_FIFO_UNRFLW ? CY_SMIF_RX_DATA_FIFO_UNDERFLOW : 0;
    pdl_intr_cause |= event_cause & CY_QSPI_IRQ_TX_DATA_FIFO_OVRFLW ? CY_SMIF_TX_DATA_FIFO_OVERFLOW : 0;
    pdl_intr_cause |= event_cause & CY_QSPI_IRQ_TX_CMD_FIFO_OVRFLW ? CY_SMIF_TX_COMMAND_FIFO_OVERFLOW : 0;
    pdl_intr_cause |= event_cause & CY_QSPI_IRQ_TX_DATA_FIFO_LEVEL_TRG ? CY_SMIF_TX_DATA_FIFO_LEVEL_TRIGGER : 0;
    pdl_intr_cause |= event_cause & CY_QSPI_IRQ_RX_DATA_FIFO_LEVEL_TRG ? CY_SMIF_RX_DATA_FIFO_LEVEL_TRIGGER : 0;

    return pdl_intr_cause;
}

/*******************************************************************************
*       Dispatcher Interrrupt Service Routine
*******************************************************************************/

static void cy_qspi_intr_wrapper_indexed(uint32_t instance_num)
{
    uint32_t intr_cause_pdl = Cy_SMIF_GetInterruptStatusMasked(irq_data_stc[instance_num].obj->base);
    cy_qspi_irq_event_t irq_status = cy_convert_interrupt_from_pdl(intr_cause_pdl);

    if (NULL != irq_data_stc[instance_num].handler)
    {
        /* Call registered callbacks here */
        irq_data_stc[instance_num].handler(irq_data_stc[instance_num].irq_arg, irq_status);
    }

    Cy_SMIF_ClearInterrupt(irq_data_stc[instance_num].obj->base, intr_cause_pdl);
}

/*******************************************************************************
*       (Internal) Interrrupt Service Routines
*******************************************************************************/

/* Handler for SMIF0 */
static void cy_qspi_0_irq_handler()
{
    cy_qspi_intr_wrapper_indexed(0);
}

/* List of interrupt handler, takes instance id as idx */
static void (*cy_qspi_intr_dispatcher_table[CY_IP_MXSMIF_INSTANCES])(void) =
{
#if (CY_IP_MXSMIF_INSTANCES > 0)
        cy_qspi_0_irq_handler,
#endif /* CY_IP_MXSMIF_INSTANCES > 0 */
};

/*******************************************************************************
*       (Internal) QSPI Pin Related Functions
*******************************************************************************/

/* Check if pin valid as resource and reserve it */
static cy_rslt_t check_pin_and_reserve(cy_gpio_t pin)
{
    cy_rslt_t result;
    cy_resource_inst_t pin_rsc = cy_utils_get_gpio_resource(pin);
    result = cy_hwmgr_reserve(&pin_rsc);
    return result;
}

/* Checks what pins are provided by user and calls check_pin_and_reserve for each */
static cy_rslt_t make_pin_reservations(cy_qspi_t *obj)
{
    cy_rslt_t result;
        
    /* reserve the SCLK pin */
    result = check_pin_and_reserve(obj->pin_sclk);

    /* reserve the ssel pin */
    if (result == CY_RSLT_SUCCESS)
    {
        result = check_pin_and_reserve(obj->pin_ssel);
    }
    /* reserve the io0 pin */
    if (result == CY_RSLT_SUCCESS)
    {
        result = check_pin_and_reserve(obj->pin_io0);
    }
    /* reserve the io1 pin */
    if ((NC != obj->pin_io1) && (CY_RSLT_SUCCESS == result))
    {
        result = check_pin_and_reserve(obj->pin_io1);
    }
    /* reserve the obj->pin_io2 pin */
    if ((NC != obj->pin_io2) && (CY_RSLT_SUCCESS == result))
    {
        result = check_pin_and_reserve(obj->pin_io2);
    }
    /* reserve the obj->pin_io3 pin */
    if ((NC != obj->pin_io3) && (CY_RSLT_SUCCESS == result))
    {
        result = check_pin_and_reserve(obj->pin_io3);
    }
    /* reserve the obj->pin_io4 pin */
    if ((NC != obj->pin_io4) && (CY_RSLT_SUCCESS == result))
    {
        result = check_pin_and_reserve(obj->pin_io4);
    }
    /* reserve the obj->pin_io5 pin */
    if ((NC != obj->pin_io5) && (CY_RSLT_SUCCESS == result))
    {
        result = check_pin_and_reserve(obj->pin_io5);
    }
    /* reserve the obj->pin_io6 pin */
    if ((NC != obj->pin_io6) && (CY_RSLT_SUCCESS == result))
    {
        result = check_pin_and_reserve(obj->pin_io6);
    }
    /* reserve the obj->pin_io7 pin */
    if ((NC != obj->pin_io7) && (CY_RSLT_SUCCESS == result))
    {
        result = check_pin_and_reserve(obj->pin_io7);        
    }
    return result;
}

