dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cy_hal_qspi.c
/* Disconnect (interconnect) pin and free it (hwmgr) as resource */
static cy_rslt_t free_pin(cy_gpio_t pin)
{
    cy_resource_inst_t rsc;
    cy_rslt_t result = cy_disconnect_pin(pin);
    if (CY_RSLT_SUCCESS == result)
    {
        rsc = cy_utils_get_gpio_resource(pin);
        result = cy_hwmgr_free(&rsc);
    }
    return result;
}

/* Free all QSPI pins */
static cy_rslt_t free_pin_connections(cy_qspi_t *obj)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_rslt_t ret_result = CY_RSLT_SUCCESS;

    if (NC != obj->pin_sclk)
    {
        result = free_pin(obj->pin_sclk);
        ret_result = CY_RSLT_SUCCESS == result ? ret_result : result;
    }
    if (NC != obj->pin_ssel)
    {
        result = free_pin(obj->pin_ssel);
        ret_result = CY_RSLT_SUCCESS == result ? ret_result : result;
    }
    if (NC != obj->pin_io0)
    {
        result = free_pin(obj->pin_io0);
        ret_result = CY_RSLT_SUCCESS == result ? ret_result : result;
    }
    if (NC != obj->pin_io1)
    {
        result = free_pin(obj->pin_io1);
        ret_result = CY_RSLT_SUCCESS == result ? ret_result : result;
    }
    if (NC != obj->pin_io2)
    {
        result = free_pin(obj->pin_io2);
        ret_result = CY_RSLT_SUCCESS == result ? ret_result : result;
    }
    if (NC != obj->pin_io3)
    {
        result = free_pin(obj->pin_io3);
        ret_result = CY_RSLT_SUCCESS == result ? ret_result : result;
    }
    if (NC != obj->pin_io4)
    {
        result = free_pin(obj->pin_io4);
        ret_result = CY_RSLT_SUCCESS == result ? ret_result : result;
    }
    if (NC != obj->pin_io5)
    {
        result = free_pin(obj->pin_io5);
        ret_result = CY_RSLT_SUCCESS == result ? ret_result : result;
    }
    if (NC != obj->pin_io6)
    {
        result = free_pin(obj->pin_io6);
        ret_result = CY_RSLT_SUCCESS == result ? ret_result : result;
    }
    if (NC != obj->pin_io7)
    {
        result = free_pin(obj->pin_io7);
        ret_result = CY_RSLT_SUCCESS == result ? ret_result : result;
    }
    return ret_result;
}

/*******************************************************************************
*       (Internal) QSPI Config Related Functions
*******************************************************************************/

/* Translates HAL bus width to PDL bus width */
static cy_en_smif_txfr_width_t get_cy_bus_width(cy_qspi_bus_width_t bus_width)
{
    cy_en_smif_txfr_width_t cy_bus_width;

    switch (bus_width)
    {
        case CY_QSPI_CFG_BUS_SINGLE:
            cy_bus_width = CY_SMIF_WIDTH_SINGLE;
            break;

        case CY_QSPI_CFG_BUS_DUAL:
            cy_bus_width = CY_SMIF_WIDTH_DUAL;
            break;

        case CY_QSPI_CFG_BUS_QUAD:
            cy_bus_width = CY_SMIF_WIDTH_QUAD;
            break;

        case CY_QSPI_CFG_BUS_OCTAL:
            cy_bus_width = CY_SMIF_WIDTH_OCTAL;
            break;

        default:
            cy_bus_width = CY_SMIF_WIDTH_SINGLE;
    }

    return cy_bus_width;
}

/* Translates cy_qspi_command_t to cy_stc_smif_mem_cmd_t */
static void convert_to_cy_cmd_config(const cy_qspi_command_t *qspi_command, cy_stc_smif_mem_cmd_t *const cy_cmd_config)
{
    /* This function does not check 'disabled' of each sub-structure in qspi_command_t
    *  It is the responsibility of the caller to check it. */
    cy_cmd_config->command = qspi_command->instruction.value;
    cy_cmd_config->cmdWidth = get_cy_bus_width(qspi_command->instruction.bus_width);
    cy_cmd_config->addrWidth = get_cy_bus_width(qspi_command->address.bus_width);
    cy_cmd_config->mode = qspi_command->alt.value;
    cy_cmd_config->modeWidth = get_cy_bus_width(qspi_command->alt.bus_width);
    cy_cmd_config->dummyCycles = qspi_command->dummy_count;
    cy_cmd_config->dataWidth = get_cy_bus_width(qspi_command->data.bus_width);
}

static void uint32_to_byte_array(uint32_t value, uint8_t *byteArray, uint32_t startPos, uint32_t size)
{
    do
    {
        size--;
        byteArray[size + startPos] = (uint8_t)(value & 0xFF);
        value >>= 0x08;
    } while (size > 0);
}

/* cy_qspi_size_t to number bytes */
static uint32_t get_size(cy_qspi_size_t hal_size)
{
    uint32_t size;

    switch (hal_size)
    {
        case CY_QSPI_CFG_SIZE_8:
            size = 1;
            break;

        case CY_QSPI_CFG_SIZE_16:
            size = 2;
            break;

        case CY_QSPI_CFG_SIZE_24:
            size = 3;
            break;

        case CY_QSPI_CFG_SIZE_32:
            size = 4;
            break;

        default:
            size = 0;
    }

    return size;
}

/* Sends QSPI command with certain set of data */
/* Address passed through 'command' is not used, instead the value in 'addr' is used. */
static cy_rslt_t qspi_command_transfer(cy_qspi_t *obj, const cy_qspi_command_t *command, uint32_t addr, bool endOfTransfer)
{
    /* max address size is 4 bytes and max alt size is 4 bytes */
    uint8_t cmd_param[8] = {0};
    uint32_t start_pos = 0;
    uint32_t addr_size = 0;
    uint32_t alt_size = 0;
    cy_en_smif_txfr_width_t bus_width = CY_SMIF_WIDTH_SINGLE;
    cy_stc_smif_mem_cmd_t cy_cmd_config;
    cy_rslt_t result = CY_RSLT_SUCCESS;

    convert_to_cy_cmd_config(command, &cy_cmd_config);

    /*  Does not support different bus_width for address and alt. 
     * bus_width is selected based on what (address or alt) is enabled. 
     * If both are enabled, bus_width of alt is selected
     * It is either possible to support 1 byte alt with different bus_width
     * by sending the alt byte as command as done in Cy_SMIF_Memslot_CmdRead()
     * in cy_smif_memslot.c or support multiple bytes of alt with same bus_width
     * as address by passing the alt bytes as cmd_param to Cy_SMIF_TransmitCommand(). 
     * Second approach is implemented here. This restriction is because of the way
     * PDL API is implemented. 
     */

    if (!command->address.disabled && !command->alt.disabled)
    {
        if (cy_cmd_config.addrWidth != cy_cmd_config.modeWidth)
        {
            result = CY_RSLT_QSPI_BUS_WIDTH_ERROR;
        }
    }

    if (CY_RSLT_SUCCESS == result)
    {
        if (!command->address.disabled)
        {
            addr_size = get_size(command->address.size);
            uint32_to_byte_array(addr, cmd_param, start_pos, addr_size);
            start_pos += addr_size;
            bus_width = cy_cmd_config.addrWidth;
        }

