dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cy_hal_qspi.c
        if (!command->alt.disabled)
        {
            alt_size = get_size(command->alt.size);
            uint32_to_byte_array(cy_cmd_config.mode, cmd_param, start_pos, alt_size);
            bus_width = cy_cmd_config.modeWidth;
        }

        uint32_t cmpltTxfr = ((endOfTransfer) ? 1UL : 0UL);
        result = (cy_rslt_t)Cy_SMIF_TransmitCommand(obj->base, cy_cmd_config.command,
                                                                 cy_cmd_config.cmdWidth, cmd_param, (addr_size + alt_size),
                                                                 bus_width, obj->slave_select, cmpltTxfr, &obj->context);
    }

    return result;
}

/* Checks, that user provided all needed pins and returns max bus width */
static cy_rslt_t check_user_pins(cy_qspi_t * obj, cy_qspi_bus_width_t * max_width)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    /* Single mode */
    if (NC == obj->pin_io0)
    {
        result = CY_RSLT_QSPI_PIN_ERROR;
    }
    else
    {
    	*max_width = CY_QSPI_CFG_BUS_SINGLE;
    }
    /* Dual mode */
    if (NC != obj->pin_io1)
    {
    	*max_width = CY_QSPI_CFG_BUS_DUAL;
    }
    /* Quad Mode */
    if ((NC != obj->pin_io2) && (CY_RSLT_SUCCESS == result))
    {
        result = NC != obj->pin_io1 ? CY_RSLT_SUCCESS : CY_RSLT_QSPI_PIN_ERROR;
        if (CY_RSLT_SUCCESS == result)
        {
            result = NC != obj->pin_io3 ? CY_RSLT_SUCCESS : CY_RSLT_QSPI_PIN_ERROR;
            if (CY_RSLT_SUCCESS == result)
            {
            	*max_width = CY_QSPI_CFG_BUS_QUAD;
            }
        }
    }
    /* Octo Mode */
    if ((NC != obj->pin_io4) && (CY_RSLT_SUCCESS == result))
    {
        result = NC != obj->pin_io1 ? CY_RSLT_SUCCESS : CY_RSLT_QSPI_PIN_ERROR;
        if (CY_RSLT_SUCCESS == result)
        {
            result = NC != obj->pin_io2 ? CY_RSLT_SUCCESS : CY_RSLT_QSPI_PIN_ERROR;
        }
        if (CY_RSLT_SUCCESS == result)
        {
            result = NC != obj->pin_io3 ? CY_RSLT_SUCCESS : CY_RSLT_QSPI_PIN_ERROR;
        }
        if (CY_RSLT_SUCCESS == result)
        {
            result = NC != obj->pin_io5 ? CY_RSLT_SUCCESS : CY_RSLT_QSPI_PIN_ERROR;
        }
        if (CY_RSLT_SUCCESS == result)
        {
            result = NC != obj->pin_io6 ? CY_RSLT_SUCCESS : CY_RSLT_QSPI_PIN_ERROR;
        }
        if (CY_RSLT_SUCCESS == result)
        {
            result = NC != obj->pin_io7 ? CY_RSLT_SUCCESS : CY_RSLT_QSPI_PIN_ERROR;
        }
        if (CY_RSLT_SUCCESS == result)
		{
        	*max_width = CY_QSPI_CFG_BUS_OCTAL;
		}

    }
    if (CY_RSLT_SUCCESS == result)
    {
        result = NC != obj->pin_sclk ? CY_RSLT_SUCCESS : CY_RSLT_QSPI_PIN_ERROR;
    }

    if (CY_RSLT_SUCCESS == result)
    {
        result = NC != obj->pin_ssel ? CY_RSLT_SUCCESS : CY_RSLT_QSPI_PIN_ERROR;
    }
    return result;
}

/* Based on ssel pin chosen, determines SMIF slave select parameter and pin mapping */
static const cy_resource_pin_mapping_t * get_slaveselect(cy_gpio_t ssel, cy_en_smif_slave_select_t *slave_select)
{
    bool pin_found = false;
    const cy_resource_pin_mapping_t * pin_mapping = CY_UTILS_GET_RESOURCE(ssel, cy_pin_map_smif_spi_select0);
    if (NULL != pin_mapping)
    {
        pin_found = true;
        *slave_select = CY_SMIF_SLAVE_SELECT_0;
    }
    if (!pin_found)
    {
        pin_mapping = CY_UTILS_GET_RESOURCE(ssel, cy_pin_map_smif_spi_select1);
        if (NULL != pin_mapping)
        {
            pin_found = true;
            *slave_select = CY_SMIF_SLAVE_SELECT_1;
        }
    }
    if (!pin_found)
    {
        pin_mapping = CY_UTILS_GET_RESOURCE(ssel, cy_pin_map_smif_spi_select2);
        if (NULL != pin_mapping)
        {
            pin_found = true;
            *slave_select = CY_SMIF_SLAVE_SELECT_2;
        }
    }
    if (!pin_found)
    {
        pin_mapping = CY_UTILS_GET_RESOURCE(ssel, cy_pin_map_smif_spi_select3);
        if (NULL != pin_mapping)
        {
            pin_found = true;
            *slave_select = CY_SMIF_SLAVE_SELECT_3;
        }  
    }

    return pin_mapping;
}

/* Based on data pins chosen, determines SMIF data select parameter */
static const cy_resource_pin_mapping_t * get_dataselect(cy_gpio_t io0, cy_en_smif_data_select_t *data_select)
{
    bool pin_found = false;
    const cy_resource_pin_mapping_t * pin_mapping = CY_UTILS_GET_RESOURCE(io0, cy_pin_map_smif_spi_data0);
    if (NULL != pin_mapping)
    {
        pin_found = true;
        *data_select = CY_SMIF_DATA_SEL0;
    }
    if (!pin_found)
    {
        pin_mapping = CY_UTILS_GET_RESOURCE(io0, cy_pin_map_smif_spi_data2);
        if (NULL != pin_mapping)
        {
            pin_found = true;
            *data_select = CY_SMIF_DATA_SEL1;
        }
    }
    if (!pin_found)
    {
        pin_mapping = CY_UTILS_GET_RESOURCE(io0, cy_pin_map_smif_spi_data4);
        if (NULL != pin_mapping)
        {
            pin_found = true;
            *data_select = CY_SMIF_DATA_SEL2;
        }
    }
    if (!pin_found)
    {
        pin_mapping = CY_UTILS_GET_RESOURCE(io0, cy_pin_map_smif_spi_data6);
        if (NULL != pin_mapping)
        {
            pin_found = true;
            *data_select = CY_SMIF_DATA_SEL3;
        }
    }
    return pin_mapping;
}

/* Check if obj->base instance is instance of QSPI */
static bool check_instance_is_correct(cy_qspi_t *obj)
{
	bool instance_correct = false;
	uint32_t i;

	for (i=0;i<CY_IP_MXSMIF_INSTANCES;i++)
	{
		if (obj->base == smif_base_addresses[i])
		{
			instance_correct = true;
			break;
		}
	}

	return instance_correct;
}

/* Free all allocated resources */
static cy_rslt_t free_resources(cy_qspi_t *obj)
{
    cy_rslt_t result;
    cy_rslt_t ret_result = CY_RSLT_SUCCESS;

    if (check_instance_is_correct(obj))
    {
    	Cy_SMIF_DeInit(obj->base);
    }
    else
    {
    	ret_result = CY_RSLT_QSPI_INSTANCE_ERROR;
    }

    if (CY_RSC_INVALID != obj->resource.type)
    {
        result = cy_hwmgr_free(&(obj->resource));
        ret_result = CY_RSLT_SUCCESS == result ? ret_result : result;
    }

    result = free_pin_connections(obj);
    ret_result = (CY_RSLT_SUCCESS == result) ? ret_result : result;

    return ret_result;
}

