dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cy_hal_qspi.c
/*******************************************************************************
*       Functions
*******************************************************************************/

cy_rslt_t cy_qspi_init(
    cy_qspi_t *obj, cy_gpio_t io0, cy_gpio_t io1, cy_gpio_t io2, cy_gpio_t io3,
    cy_gpio_t io4, cy_gpio_t io5, cy_gpio_t io6, cy_gpio_t io7, cy_gpio_t sclk,
    cy_gpio_t ssel, uint32_t hz, uint8_t mode)
{
    /* mode (CPOL and CPHA) is not supported in PSoC 6 */
    (void)mode;

    cy_en_smif_slave_select_t slave_select = CY_SMIF_SLAVE_SELECT_0;
    cy_en_smif_data_select_t data_select = CY_SMIF_DATA_SEL0;
    cy_qspi_bus_width_t max_width;

    obj->pin_sclk = sclk;
    obj->pin_ssel = ssel;
    obj->pin_io0 = io0;
    obj->pin_io1 = io1;
    obj->pin_io2 = io2;
    obj->pin_io3 = io3;
    obj->pin_io4 = io4;
    obj->pin_io5 = io5;
    obj->pin_io6 = io6;
    obj->pin_io7 = io7;

    cy_rslt_t result = check_user_pins(obj, &max_width);  

    const cy_resource_pin_mapping_t *ssel_map = NULL;
    const cy_resource_pin_mapping_t *io0_map = NULL;
    const cy_resource_pin_mapping_t *io1_map = NULL;
    const cy_resource_pin_mapping_t *io2_map = NULL;
    const cy_resource_pin_mapping_t *io3_map = NULL;
    const cy_resource_pin_mapping_t *io4_map = NULL;
    const cy_resource_pin_mapping_t *io5_map = NULL;
    const cy_resource_pin_mapping_t *io6_map = NULL;
    const cy_resource_pin_mapping_t *io7_map = NULL;
    const cy_resource_pin_mapping_t *sclk_map = CY_UTILS_GET_RESOURCE(sclk, cy_pin_map_smif_spi_clk);    

    if (NULL == sclk_map)
    {
        result = CY_RSLT_QSPI_PIN_ERROR;
    }
    if (CY_RSLT_SUCCESS == result)
    {
        ssel_map = get_slaveselect(ssel, &slave_select);
        if (ssel_map == NULL)
        {
            result = CY_RSLT_QSPI_PIN_ERROR;
        }
        else
        {
            obj->slave_select = slave_select;
        }
        
    }
    if (CY_RSLT_SUCCESS == result)
    {
        io0_map = get_dataselect(obj->pin_io0, &data_select);
        if (io0_map == NULL)
        {
            result = CY_RSLT_QSPI_PIN_ERROR;
        }
        else
        {
            obj->data_select = data_select;
        }
        
    }
    if (CY_RSLT_SUCCESS == result)
    {
        switch (data_select)
        {
            case CY_SMIF_DATA_SEL0:
                if (max_width >= CY_QSPI_CFG_BUS_DUAL)
                {
                    io1_map = CY_UTILS_GET_RESOURCE(obj->pin_io1, cy_pin_map_smif_spi_data1);
                    if (NULL == io1_map)
                    {
                        result = CY_RSLT_QSPI_PIN_ERROR;
                    }
                }
                if (max_width >= CY_QSPI_CFG_BUS_QUAD)
                {
                    io2_map = CY_UTILS_GET_RESOURCE(obj->pin_io2, cy_pin_map_smif_spi_data2);
                    io3_map = CY_UTILS_GET_RESOURCE(obj->pin_io3, cy_pin_map_smif_spi_data3);
                    if ((NULL == io2_map) || (NULL == io3_map))
                    {
                        result = CY_RSLT_QSPI_PIN_ERROR;
                    }
                }
                if (max_width >= CY_QSPI_CFG_BUS_OCTAL)
                {
                    io4_map = CY_UTILS_GET_RESOURCE(obj->pin_io4, cy_pin_map_smif_spi_data4);
                    io5_map = CY_UTILS_GET_RESOURCE(obj->pin_io5, cy_pin_map_smif_spi_data5);
                    io6_map = CY_UTILS_GET_RESOURCE(obj->pin_io6, cy_pin_map_smif_spi_data6);
                    io7_map = CY_UTILS_GET_RESOURCE(obj->pin_io7, cy_pin_map_smif_spi_data7);
                    if ((NULL == io4_map) || (NULL == io5_map) || (NULL == io6_map) || (NULL == io7_map))
                    {
                        result = CY_RSLT_QSPI_PIN_ERROR;    
                    }
                }
                break;

            case CY_SMIF_DATA_SEL1:
                if (max_width >= CY_QSPI_CFG_BUS_DUAL)
                {
                    io1_map = CY_UTILS_GET_RESOURCE(obj->pin_io1, cy_pin_map_smif_spi_data3);
                    if (NULL == io1_map)
                    {
                        result = CY_RSLT_QSPI_PIN_ERROR;
                    }
                }
                break;

            case CY_SMIF_DATA_SEL2:
                if (max_width >= CY_QSPI_CFG_BUS_DUAL)
                {
                    io1_map = CY_UTILS_GET_RESOURCE(obj->pin_io1, cy_pin_map_smif_spi_data5);
                    if (NULL == io1_map)
                    {
                        result = CY_RSLT_QSPI_PIN_ERROR;    
                    }
                }
                if (max_width >= CY_QSPI_CFG_BUS_QUAD)
                {
                    io2_map = CY_UTILS_GET_RESOURCE(obj->pin_io2, cy_pin_map_smif_spi_data6);
                    io3_map = CY_UTILS_GET_RESOURCE(obj->pin_io3, cy_pin_map_smif_spi_data7);
                    if ((NULL == io2_map) || (NULL == io3_map))
                    {
                        result = CY_RSLT_QSPI_PIN_ERROR;    
                    }
                }
                break;

            case CY_SMIF_DATA_SEL3:
                if (max_width >= CY_QSPI_CFG_BUS_DUAL)
                {
                    io1_map = CY_UTILS_GET_RESOURCE(obj->pin_io1, cy_pin_map_smif_spi_data7);
                    if (NULL == io1_map)
                    {
                        result = CY_RSLT_QSPI_PIN_ERROR;
                    }
                }
                break;

            default:
                result = CY_RSLT_QSPI_DATA_SEL_ERROR;
        }
    }
    /* Check that all pins are belongs to same instance */
    if (CY_RSLT_SUCCESS == result)
    {
        if (sclk_map->inst->block_num != ssel_map->inst->block_num)
        {
            result = CY_RSLT_QSPI_PIN_ERROR;
        }
    }
    if (CY_RSLT_SUCCESS == result)
    {
        if (sclk_map->inst->block_num != io0_map->inst->block_num)
        {
            result = CY_RSLT_QSPI_PIN_ERROR;
        }
        if ((max_width >= CY_QSPI_CFG_BUS_DUAL) && (CY_RSLT_SUCCESS == result))
        {
            if (sclk_map->inst->block_num != io1_map->inst->block_num)
            {
				result = CY_RSLT_QSPI_PIN_ERROR;
			}
        }
    }
    /* Pins io2 and io3 are only available in CY_SMIF_DATA_SEL0 and CY_SMIF_DATA_SEL2 modes */
    if ((CY_RSLT_SUCCESS == result) && ((data_select == CY_SMIF_DATA_SEL0) || (data_select == CY_SMIF_DATA_SEL2)) 
        && (max_width >= CY_QSPI_CFG_BUS_QUAD))
    {
        if ((sclk_map->inst->block_num != io2_map->inst->block_num) ||
            (sclk_map->inst->block_num != io3_map->inst->block_num))
        {
            result = CY_RSLT_QSPI_PIN_ERROR;
        }
    }
    /* Pins io4, io5, io6 and io7 are only available in CY_SMIF_DATA_SEL0 mode */
    if ((CY_RSLT_SUCCESS == result) && (data_select == CY_SMIF_DATA_SEL0) && (max_width >= CY_QSPI_CFG_BUS_OCTAL))
    {
        if ((sclk_map->inst->block_num != io4_map->inst->block_num) ||
            (sclk_map->inst->block_num != io5_map->inst->block_num) ||
            (sclk_map->inst->block_num != io6_map->inst->block_num) ||
            (sclk_map->inst->block_num != io7_map->inst->block_num))
        {
            result = CY_RSLT_QSPI_PIN_ERROR;
        }
    }

    obj->resource = *sclk_map->inst;

    if (CY_RSLT_SUCCESS == result)
    {
        result = make_pin_reservations(obj);
    }

