dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cy_hal_qspi.c
    obj->base = smif_base_addresses[obj->resource.block_num];

    if (CY_RSLT_SUCCESS == result)
    {
        result = cy_connect_pin(sclk_map);
        if (CY_RSLT_SUCCESS == result)
        {
            result = cy_connect_pin(ssel_map);
        }
        if (CY_RSLT_SUCCESS == result)
        {
            result = cy_connect_pin(io0_map);
        }
        if ((CY_RSLT_SUCCESS == result) && (max_width >= CY_QSPI_CFG_BUS_DUAL))
        {
            result = cy_connect_pin(io1_map);
        }
    }        
    if ((CY_RSLT_SUCCESS == result) && ((data_select == CY_SMIF_DATA_SEL0) || (data_select == CY_SMIF_DATA_SEL2)) &&
        (max_width >= CY_QSPI_CFG_BUS_QUAD))
    {
        result = cy_connect_pin(io2_map);
        if (CY_RSLT_SUCCESS == result)
        {
            result = cy_connect_pin(io3_map);
        }
    } 
    if ((CY_RSLT_SUCCESS == result) && (data_select == CY_SMIF_DATA_SEL0) && (max_width >= CY_QSPI_CFG_BUS_OCTAL))
    {
        result = cy_connect_pin(io4_map);
        if (CY_RSLT_SUCCESS == result)
        {
            result = cy_connect_pin(io5_map);
        }
        if (CY_RSLT_SUCCESS == result)
        {
            result = cy_connect_pin(io6_map);
        }
        if (CY_RSLT_SUCCESS == result)
        {
            result = cy_connect_pin(io7_map);
        }
    }

    if (CY_RSLT_SUCCESS == result)
    {
        result = cy_qspi_frequency(obj, hz);
    }

    bool configured = false;
    if (CY_RSLT_SUCCESS == result)
    {
        result = cy_hwmgr_is_configured(obj->resource.type, obj->resource.block_num, obj->resource.channel_num, &configured);
    }

    if ((CY_RSLT_SUCCESS == result) && !configured)
    {
        result = (cy_rslt_t)Cy_SMIF_Init(obj->base, &default_qspi_config, TIMEOUT_10_MS, &obj->context);

        Cy_SMIF_SetDataSelect(obj->base, slave_select, data_select);
        Cy_SMIF_Enable(obj->base, &obj->context);
        cy_hwmgr_set_configured(obj->resource.type, obj->resource.block_num, obj->resource.channel_num);
    }

    if (CY_RSLT_SUCCESS == result)
    {
    	result = cy_hwmgr_reserve(&(obj->resource));
    }

    if (CY_RSLT_SUCCESS != result)
    {
        free_resources(obj);
    }

    return result;
}

cy_rslt_t cy_qspi_free(cy_qspi_t *obj)
{
    cy_rslt_t result;
    cy_rslt_t ret_result;

    if (NULL != obj)
    {
    	ret_result = free_resources(obj);
    	result = cy_hwmgr_set_unconfigured(obj->resource.type, obj->resource.block_num, obj->resource.channel_num);
		ret_result = (CY_RSLT_SUCCESS == result) ? ret_result : result;
    }
    else
    {
    	ret_result = CY_RSLT_QSPI_INSTANCE_ERROR;
    }

    return ret_result;
}

cy_rslt_t cy_qspi_frequency(cy_qspi_t *obj, uint32_t hz)
{
    /* TODO after HAL clock management implemented JIRA: BSP-510 */
    (void) obj;
    (void) hz;
    return CY_RSLT_SUCCESS;
}

/* no restriction on the value of length. This function splits the read into multiple chunked transfers. */
cy_rslt_t cy_qspi_read(cy_qspi_t *obj, const cy_qspi_command_t *command, void *data, size_t *length)
{
    cy_rslt_t status = CY_RSLT_SUCCESS;
    uint32_t chunk = 0;
    size_t read_bytes = *length;
    uint32_t addr = command->address.value;

    /* SMIF can read only up to 65536 bytes in one go. Split the larger read into multiple chunks */
    while (read_bytes > 0)
    {
        chunk = (read_bytes > SMIF_MAX_RX_COUNT) ? (SMIF_MAX_RX_COUNT) : read_bytes;

        /* Address is passed outside command during a read of more than 65536 bytes. Since that
         * read has to be split into multiple chunks, the address value needs to be incremented
         * after every chunk has been read. This requires either modifying the address stored in
         * 'command' passed to read() which is not possible since command is a const pointer or 
         * to create a copy of the command object. Instead of copying the object, the address is
         * passed separately. 
         */
        status = qspi_command_transfer(obj, command, addr, false);

        if (CY_RSLT_SUCCESS == status)
        {
            if (command->dummy_count > 0u)
            {
                status = (cy_rslt_t)Cy_SMIF_SendDummyCycles(obj->base, command->dummy_count);
            }

            if (CY_RSLT_SUCCESS == status)
            {
                status = (cy_rslt_t)Cy_SMIF_ReceiveDataBlocking(obj->base, (uint8_t *)data, chunk,
                                                                            get_cy_bus_width(command->data.bus_width), 
                                                                            &obj->context);
                if (CY_RSLT_SUCCESS != status)
                {
                    break;
                }
            }
        }
        read_bytes -= chunk;
        addr += chunk;
        data = (uint8_t *)data + chunk;
    }

    return status;
}

/* length can be up to 65536. */
cy_rslt_t cy_qspi_write(cy_qspi_t *obj, const cy_qspi_command_t *command, const void *data, size_t *length)
{
    cy_rslt_t status = qspi_command_transfer(obj, command, command->address.value, false);

    if (CY_RSLT_SUCCESS == status)
    {
        if (command->dummy_count > 0u)
        {
            status = (cy_rslt_t)Cy_SMIF_SendDummyCycles(obj->base, command->dummy_count);
        }

        if (CY_SMIF_SUCCESS == status)
        {
            status = (cy_rslt_t)Cy_SMIF_TransmitDataBlocking(obj->base, (uint8_t *)data, *length,
                                                      get_cy_bus_width(command->data.bus_width), &obj->context);
        }
    }

    return status;
}

cy_rslt_t cy_qspi_transfer(
    cy_qspi_t *obj, const cy_qspi_command_t *command, const void *tx_data, size_t tx_size, void *rx_data, size_t rx_size)
{
    cy_rslt_t status = CY_RSLT_SUCCESS;

    if ((tx_data == NULL || tx_size == 0) && (rx_data == NULL || rx_size == 0))
    {
        /* only command, no rx or tx */
        status = qspi_command_transfer(obj, command, command->address.value, true);
    }
    else
    {
        if (tx_data != NULL && tx_size)
        {
            status = cy_qspi_write(obj, command, tx_data, &tx_size);
        }

        if (status == CY_RSLT_SUCCESS)
        {
            if (rx_data != NULL && rx_size)
            {
                status = cy_qspi_read(obj, command, rx_data, &rx_size);
            }
        }
    }
    return status;
}

cy_rslt_t cy_qspi_register_irq(cy_qspi_t *obj, cy_qspi_irq_handler_t handler, void *handler_arg)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    uint8_t idx = obj->resource.block_num;
    irq_data_stc[idx].obj = obj;
    irq_data_stc[idx].handler = handler;
    irq_data_stc[idx].irq_arg = handler_arg;

    if (NVIC_GetEnableIRQ(CY_QSPI_IRQ_N[idx]) == 0)
    {
        /* default interrupt priority of 7 (lowest possible priority). */
        cy_stc_sysint_t irqCfg = {
            .intrSrc = CY_QSPI_IRQ_N[idx],
            .intrPriority = 7u};
        Cy_SMIF_SetInterruptMask(
            irq_data_stc[idx].obj->base, cy_convert_interrupt_to_pdl(irq_data_stc[idx].obj->irq_cause));
        Cy_SysInt_Init(&irqCfg, cy_qspi_intr_dispatcher_table[idx]);
        NVIC_EnableIRQ(CY_QSPI_IRQ_N[idx]);
    }

    return result;
}

cy_rslt_t cy_qspi_irq_enable(cy_qspi_t *obj, cy_qspi_irq_event_t event, bool enable)
{
    if (enable)
    {
        obj->irq_cause |= event;
    }
    else
    {
        obj->irq_cause &= ~event;
    }
    return CY_RSLT_SUCCESS;
}

#if defined(__cplusplus)
}
#endif /* __cplusplus */
